# AsValueString Method (Document, FormatOptions) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EvaluatedParameter..::..AsValueString Method (Document, FormatOptions)
EvaluatedParameter Class See Also
---
Get the parameter value as a string with units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public string AsValueString(
	Document doc,
	FormatOptions options
)
```

Visual Basic
---
```text
Public Function AsValueString ( _
	doc As Document, _
	options As FormatOptions _
) As String
```

Visual C++
---
```text
public:
String^ AsValueString(
	Document^ doc,
	FormatOptions^ options
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document to be used to obtain information about the parameter.
options
    Type: Autodesk.Revit.DB..::..FormatOptions Options for formatting the string.
# ### Return Value
The string that represents the parameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EvaluatedParameter Class
AsValueString Overload
Autodesk.Revit.DB Namespace